install.packages("KoNLP")
install.packages("rvest")
install.packages("stringr")
#install.packages("RHINO")
if(!require(RHINO)) {install_github("SukjaeChoi/RHINO"); library(RHINO)}


library(rJava)
library(KoNLP)
library(rvest)
library(stringr)

install.packages("rJava")
Sys.setenv(JAVA_HOME="C:/Program Files/Java/jdk-11.0.4/")

knu = read.csv("G:/SentiWord_Dict.csv", header=FALSE, sep='\t', encoding='UTF-8')
head(knu)

doc <- read.txt("G:/result.txt")

url="https://news.naver.com/main/ranking/read.nhn?mid=etc&sid1=111&rankingType=popular_day&oid=003&aid=0008737816&date=20180802&type=1&rankingSeq=8&rankingSectionId=100" # URL
page <- read_html(url,encoding = "euc-kr") # ¿Œƒ⁄µ˘ »Æ¿Œ«œ±‚ 
doc <- page%>%html_nodes("#articleBodyContents")%>%html_text()
doc

mode(doc)

#doc <- "¥Î∂Ù¿˚¿∏∑Œ ¿˚¥Á«œ¥Ÿ. ¿ﬂ ∞°∏£√ƒ¡÷ºÃΩ¿¥œ¥Ÿ. ¿Ã∑± ¥‹±‚∞£ø° ¿Ã æÁ¿ª ºˆæ˜«œΩ√¥¿∂Û ∞Ìª˝«œºÃ∞ŸΩ¿¥œ¥Ÿ. π›∫π¿˚¿∏∑Œ ∫πΩ¿¿Ã µ«º≠ ¡¡æ“Ω¿¥œ¥Ÿ. ±Ú≤˚«ﬂΩ¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. æÀ∑π∏£±‚∏¶ ¿Áπ‘∞‘ πËøÔºˆ¿÷æ˙Ω¿¥œ¥Ÿ. ∞≠¿«∏¶ ¿ﬂ«œΩ√¥¬ ±≥ºˆ¥‘µÈ¿Ã ∏π¿∏ºÃ¥Ÿ. ∏∏£∞⁄¥Ÿ. ∫ª2 √π∞˙∏Òø° ∫˝∫˝«œ¡ˆæ ¿∫ ∞˙∏Ò¿ÃæÓº≠ ∏∏¡∑Ω∫∑Øø¸Ω¿¥œ¥Ÿ. ±≥ºˆ¥‘≤≤º≠ ø≠¡§¿˚¿∏∑Œ ∞°∏£√ƒ¡÷º≈º≠ ∞®ªÁ«ﬂ¥Ÿ. ≥— ¡¡æ∆ø‰. ºˆæ˜Ω√ºˆ∞° ¿˚æÓ ∫Œ¥„¿Ã ¥˙«ﬂ¥Ÿ. æÀ∑π∏£±‚∏¶ πËøÔºˆ ¿÷æ˙Ω¿¥œ¥Ÿ. ¿ﬂ∞°∏£√ƒ¡÷º≈º≠∞®ªÁ«’¥œ¥Ÿ. ∆Ø»˜ ∞≠πŒ±‘±≥ºˆ¥‘ º≥∏Ì¿ª ¡∂∞Ô¡∂∞Ô ¿ﬂ«ÿ ¡÷º≈º≠ ≥ π´ ¡¡æ“æÓø‰. æÀ∑π∏£±‚∏¶ πËø¸Ω¿¥œ¥Ÿ. ¿œªÛø°º≠ »Á»˜∫∏¥¬ æ∆≈‰««≥™ æÀ∑Ø¡ˆø° ¥Î«— ¡ˆΩƒ¿Ã∂Ûº≠ ¡¡æ“Ω¿¥œ¥Ÿ. ±Ë¡ˆ«ˆ ±≥ºˆ¥‘ ¡ı∑ ≈‰¿«∂ß ¿œæÓ≥™º≠ πﬂ«•Ω√≈∞¥¬∞‘ æ∆¥œ∞Ì ¡˜¡¢ ø¿º≈º≠ ¿˙»Ò æÍ±‚ µÈæÓ¡÷Ω« ∂ß ∆≤∏±±Ó∫¡ ±‰¿Âµ«¥¬∞Õµµ ¥˙«œ∞Ì ∏∏£¥¬∞≈ ¡˙πÆ«“ ºˆ ¿÷æÓº≠ ¡¡æ“æÓø‰. ¡¡æ“Ω¿¥œ¥Ÿ. ¡ı∑ ≈‰¿«∞° ¿Ã«ÿø° µµøÚ¿Ã µ«æ˙¥Ÿ. æÀ∑π∏£±‚ø°¥Î«ÿ æÀºˆ¿÷æÓº≠ ¡¡æ“Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁµÂ∏≥¥œ¥Ÿ. ¥Î∂Ù¿˚¿∏∑Œ ¿˚¥Á«ﬂ¥Ÿ. √÷¿Œæ∆ ±≥ºˆ¥‘ ∞≠¿«∑œ¿Ã ≥ π´ ∫∏±‚ æÓ∑∆Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. º“±◊∑Ï≈‰¿«∏¶ ∞≠¿«Ω«ø°º≠ «ÿµµ µ…∞Õ∞∞Ω¿¥œ¥Ÿ. ¡ˆ±›µµ¡¡Ω¿¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫∞° æÁ¿Ã ≥ π´ ∏π¥Ÿ. ∑˘∏∂∆ºΩ∫ ∫Œ∫–¿Ã ≥ π´ ∏πΩ¿¥œ¥Ÿ. æÁ¿ª ¡∂¿˝«ÿ¡÷º≈º≠ ¿¸¥ﬁ«ÿ¡÷ºÃ∏£∏È «’¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫∞° »ƒπ›ø° ∏Ùæ∆ƒ°¥œ±Ó ø‹øÔ∞‘ ≥ π´ ∏πæ∆ø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿ª ≥ π´ ª°∏Æ«œΩ√¥¬µ• ¡∂±› ø©¿Ø∏¶ ∞°¡ˆ∞Ì ºˆæ˜«ÿ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ §–§– ¿ÃπÃ æ∆¥¬ ≥ªøÎ¿ª ¥ŸΩ√«—π¯ ∞≠¿««ÿ¡÷Ω√¥¬ º”µµ√≥∑≥ ≥ π´ ª°∏Æ ¡¯«‡µ«¥¬∞≈ ∞∞Ω¿¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫≥ª∞˙ ∞≠¿«æÁ¿Ã ∏π¿∫µ• ∫Ò±≥¿˚ µ⁄ø°«ÿº≠ ∞¯∫Œ«œ±‚∞° »˚µÈæ˙Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸ ≥Øø° ¡§∏Æ«“ ºˆ ¿÷¥¬ Ω√∞£¿ª ¡ª ¥ı ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ¡¡¿∫ºˆæ˜ ∞®ªÁµÂ∏≥¥œ¥Ÿ. ∑π∆˜∆Æ µÓ¿« ∆Ú∞°ø‰º“ √ﬂ∞°. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿Ã ≥ π´ ∫¸∏£º≈ø‰ §–§–. ∏∏£∞⁄¥Ÿ.  ≥ªøÎ¿Ã ∏π¿Ã ∞„ƒ°¥¬µ• ¡§∏Æ«“ ºˆ ¿÷¥¬ ∆ƒ¿œ¿Ã ¿÷æ˙¿∏∏È «’¥œ¥Ÿ. µø¿œ ¡˙»Øø° ¥Î«ÿº≠ ƒ°∑·ø° ¥Î«ÿº≠ ∞∞¿∫ ∞≠¿«∑œ¿∏∑Œ ºˆæ˜ ¡÷ºÃ¿∏∏È ¡¡¿ª∞Õ ∞∞¥Ÿ. ≥—¡∂æ∆ø‰. ∞„ƒ°¥¬ ∫Œ∫–ø° ¿÷æÓº≠ ±≥ºˆ¥‘µÈ¿« º≥∏Ì¿Ã ¿œƒ°«ﬂ¿∏∏È ¥˙ «Ú∞•∏±∞Õ∞∞¥Ÿ. ∆Ø∫∞»˜ æ¯Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸≥Øø°¿÷¥¬ºˆæ˜¿ª ¡ª¥Á∞‹º≠«œ∏È¡¡∞⁄æÓø‰§Ã§Ã. ≥ π´æÁ¿Ã∏πΩ¿¥œ¥Ÿ. æÁ¡ª ¡Ÿø©¡÷ººø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ¡¶πﬂ ∞≠¿«æÁ¡ª ¡Ÿø©¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ¡¡æ“Ω¿¥œ¥Ÿ.æÀ∑π∏£±‚ ¡˙»Øºˆæ˜∞˙ ∑˘∏∂∆ºΩ∫ ¡˙»Øºˆæ˜¿Ã ºØø©¿÷æÓº≠ µŒ ƒ´≈◊∞Ì∏Æ∏¶ ±∏∫–«œ¥¬µ• »˚µÈæ˙Ω¿. ºˆæ˜º”µµ∞° ¥¿∑¡¡≥¿∏∏È ¡¡∞⁄¥Ÿ. ∞¯∫ŒΩ√∞£ ¿Ã ≥À≥À«ﬂ¿∏¡¡∞⁄Ω¿¥œ¥Ÿ. º¯º≠∞° µ⁄¡◊π⁄¡◊¿Ãø°ø‰.∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ."
doc <- "∑˘∏∂∆ºΩ∫∞° æÁ¿Ã ≥ π´ ∏π¥Ÿ. ∑˘∏∂∆ºΩ∫ ∫Œ∫–¿Ã ≥ π´ ∏πΩ¿¥œ¥Ÿ. æÁ¿ª ¡∂¿˝«ÿ¡÷º≈º≠ ¿¸¥ﬁ«ÿ¡÷ºÃ∏£∏È «’¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫∞° »ƒπ›ø° ∏Ùæ∆ƒ°¥œ±Ó ø‹øÔ∞‘ ≥ π´ ∏πæ∆ø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿ª ≥ π´ ª°∏Æ«œΩ√¥¬µ• ¡∂±› ø©¿Ø∏¶ ∞°¡ˆ∞Ì ºˆæ˜«ÿ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ §–§– ¿ÃπÃ æ∆¥¬ ≥ªøÎ¿ª ¥ŸΩ√«—π¯ ∞≠¿««ÿ¡÷Ω√¥¬ º”µµ√≥∑≥ ≥ π´ ª°∏Æ ¡¯«‡µ«¥¬∞≈ ∞∞Ω¿¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫≥ª∞˙ ∞≠¿«æÁ¿Ã ∏π¿∫µ• ∫Ò±≥¿˚ µ⁄ø°«ÿº≠ ∞¯∫Œ«œ±‚∞° »˚µÈæ˙Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸ ≥Øø° ¡§∏Æ«“ ºˆ ¿÷¥¬ Ω√∞£¿ª ¡ª ¥ı ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ¡¡¿∫ºˆæ˜ ∞®ªÁµÂ∏≥¥œ¥Ÿ. ∑π∆˜∆Æ µÓ¿« ∆Ú∞°ø‰º“ √ﬂ∞°. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿Ã ≥ π´ ∫¸∏£º≈ø‰ §–§–. ∏∏£∞⁄¥Ÿ.  ≥ªøÎ¿Ã ∏π¿Ã ∞„ƒ°¥¬µ• ¡§∏Æ«“ ºˆ ¿÷¥¬ ∆ƒ¿œ¿Ã ¿÷æ˙¿∏∏È «’¥œ¥Ÿ. µø¿œ ¡˙»Øø° ¥Î«ÿº≠ ƒ°∑·ø° ¥Î«ÿº≠ ∞∞¿∫ ∞≠¿«∑œ¿∏∑Œ ºˆæ˜ ¡÷ºÃ¿∏∏È ¡¡¿ª∞Õ ∞∞¥Ÿ. ≥—¡∂æ∆ø‰. ∞„ƒ°¥¬ ∫Œ∫–ø° ¿÷æÓº≠ ±≥ºˆ¥‘µÈ¿« º≥∏Ì¿Ã ¿œƒ°«ﬂ¿∏∏È ¥˙ «Ú∞•∏±∞Õ∞∞¥Ÿ. ∆Ø∫∞»˜ æ¯Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸≥Øø°¿÷¥¬ºˆæ˜¿ª ¡ª¥Á∞‹º≠«œ∏È¡¡∞⁄æÓø‰§Ã§Ã. ≥ π´æÁ¿Ã∏πΩ¿¥œ¥Ÿ. æÁ¡ª ¡Ÿø©¡÷ººø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ¡¶πﬂ ∞≠¿«æÁ¡ª ¡Ÿø©¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ¡¡æ“Ω¿¥œ¥Ÿ.æÀ∑π∏£±‚ ¡˙»Øºˆæ˜∞˙ ∑˘∏∂∆ºΩ∫ ¡˙»Øºˆæ˜¿Ã ºØø©¿÷æÓº≠ µŒ ƒ´≈◊∞Ì∏Æ∏¶ ±∏∫–«œ¥¬µ• »˚µÈæ˙Ω¿. ºˆæ˜º”µµ∞° ¥¿∑¡¡≥¿∏∏È ¡¡∞⁄¥Ÿ. ∞¯∫ŒΩ√∞£ ¿Ã ≥À≥À«ﬂ¿∏¡¡∞⁄Ω¿¥œ¥Ÿ. º¯º≠∞° µ⁄¡◊π⁄¡◊¿Ãø°ø‰.∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ."


words.pa <- function(doc)
{
  doc <- as.character(doc)
  doc2 <- paste(SimplePos22(doc))
  doc3 <- str_match(doc2, "([∞°-∆R]+)/(PA)")
  doc4 <- doc3[,2]
  doc4[!is.na(doc4)]
}

words.nc <- function(doc)
{
  doc <- as.character(doc)
  doc2 <- paste(SimplePos22(doc))
  doc3 <- str_match(doc2, "([∞°-∆R]+)/(NC)")
  doc4 <- doc3[,2]
  doc4[!is.na(doc4)]
}

words.pv <- function(doc)
{
  doc <- as.character(doc)
  doc2 <- paste(SimplePos22(doc))
  doc3 <- str_match(doc2, "([∞°-∆R]+)/(PV)")
  doc4 <- doc3[,2]
  doc4[!is.na(doc4)]
}

### ∏ÌªÁ√ﬂ√‚
doc.nc=words.nc(doc)
doc.nc

### «¸øÎªÁ√ﬂ√‚ 
doc.pa=words.pa(doc)
doc.pa

### µøªÁ√ﬂ√‚ 
doc.pv=words.pv(doc)
doc.pv

### ¡ﬂ∫π ªË¡¶ 
doc.nc=unique(doc.nc)
doc.pa=unique(doc.pa)
doc.pv=unique(doc.pv)

doc.pa.df=as.data.frame(doc.pa)
write.csv(doc.pa.df,"g:/data/doc.pa.csv",fileEncoding = "EUC-KR")
doc.pa.df

doc.nc.df=as.data.frame(doc.nc)
write.csv(doc.nc.df,"g:/data/doc.nc.csv",fileEncoding = "UTF-8")

doc.pv.df=as.data.frame(doc.pv)
write.csv(doc.pv.df,"g:/data/doc.pv.csv",fileEncoding = "UTF-8")

setwd("g:/")

positive <- readLines(file("g:/data/pos_pol_word.txt", encoding = "UTF-8"))
positive
positive=positive[-1]

negative <- readLines(file("g:/data/neg_pol_word.txt", encoding = "UTF-8"))
negative
negative=negative[-1]

txt <- readLines(file("g:/result.txt",encoding = "UTF-8"))
txt <- doc
pos=SimplePos22(txt)
pos

pos.vec=unlist(pos)
pos.vec

pos.vec<-gsub("[[:alpha:]]","",pos.vec) # øµæÓ ªË¡¶
pos.vec

pos.vec<-gsub("/","",pos.vec) # /ªË¡¶
pos.vec

pos.vec<-gsub("[+§°§§]","",pos.vec) # +,§°,§§ªË¡¶
pos.vec

pos.matches.num<-match(pos.vec,positive) # ±‡¡§æÓ ∫§≈Õ π¯»£
neg.matches.num<-match(pos.vec,negative) # ∫Œ¡§æÓ ∫§≈Õ π¯»£ 

pos.matches.num 
neg.matches.num

pos.matches <- !is.na(pos.matches.num)
neg.matches <- !is.na(neg.matches.num)

pos.sum=sum(pos.matches)
neg.sum=sum(neg.matches)
pos.sum ; neg.sum

result <- pos.sum-neg.sum

if(result>0){
  print("±‡¡§")
}else if(result==0){
  print("¡ﬂ∏≥")
}else{
  print("∫Œ¡§")
}

sigmoid <- function(x){
  1/(1+exp(-x))
}

x=seq(from=-5,to=5,by=0.1)
plot(x,sigmoid(x),col="red")



library(devtools)
install_github("SukJaeChoi/easySenti")
library(easySenti)


positive <- readLines(file("g:/data/pos_pol_word.txt", encoding = "utf-8"))
positive=positive[-1]
positive

negative <- readLines(file("g:/data/neg_pol_word.txt", encoding = "utf-8"))
negative=negative[-1]
negative

#docs <- readLines(file("g:/result.txt",encoding = "utf-8"))
doc <- "¥Î∂Ù¿˚¿∏∑Œ ¿˚¥Á. ø≠Ω…»˜ ∞°∏£√ƒ¡÷º≈º≠ ∞®ªÁµÂ∏≥¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ºˆæ˜∫∞∑Œ ¡∂±›æø ø¨∞·¿Ã µ≈º≠ µµøÚ¿Ã µ∆Ω¿¥œ¥Ÿ. ºˆæ˜Ω√∞£¿Ã¿˚æÓº≠ ¡¡æ“Ω¿¥œ¥Ÿ. ¿ﬂ∏∏£∞⁄¥Ÿ. ¿ﬂ ∞°∏£√ƒ¡÷ºÃΩ¿¥œ¥Ÿ. ¿Ã∑± ¥‹±‚∞£ø° ¿Ã æÁ¿ª ºˆæ˜«œΩ√¥¿∂Û ∞Ìª˝«œºÃ∞ŸΩ¿¥œ¥ı. π›∫πµ«¥¬ ∫πΩ¿. ±Ú≤˚«ﬂΩ¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. æÀ∑π∏£±‚∏¶ ¿Áπ‘∞‘ πËøÔºˆ¿÷æ˙Ω¿¥œ¥Ÿ. √‚ºÆ√º≈©¿⁄¡÷«ÿº≠ ∫Ò¡ﬂ≥Ù¿Ã¥¬∞Õ. ∞≠¿«∏¶ ¿ﬂ«œΩ√¥¬ ±≥ºˆ¥‘µÈ¿Ã ∏π¿∏ºÃ¥Ÿ. ∏∏£∞⁄¥Ÿ. ∫ª2√π∞˙∏Òø° ∫˝∫˝«œ¡ˆæ ¿∫ ∞˙∏Ò¿ÃæÓº≠ ∏∏¡∑Ω∫∑Øø¸Ω¿¥œ¥Ÿ. ±≥ºˆ¥‘≤≤º≠ ø≠¡§¿˚¿∏∑Œ ∞°∏£√ƒ¡÷º≈º≠ ∞®ªÁ«ﬂ¥Ÿ. ≥—¡∂æ∆ø‰. ºˆæ˜Ω√ºˆ∞° ¿˚æÓ ∫Œ¥„¿Ã ¥˙«ﬂ¥Ÿ,. æÀ∑π∏£±‚∏¶ πËøÔºˆ ¿÷æ˙Ω¿¥œ¥Ÿ. ¿ﬂ∞°∏£√ƒ¡÷º≈º≠∞®ªÁ«’¥œ¥Ÿ ∆Ø»˜ ∞≠πŒ±‘±≥ºˆ¥‘ º≥∏Ì¡∂∞Ô¡∂∞Ô¿ﬂ«ÿ¡÷º≈º≠ ≥ π´¡¡æ“æÓø‰. æÀ∑π∏£±‚∏¶ πËø¸Ω¿¥œ¥Ÿ. ¿œªÛø°º≠»Á»˜∫∏¥¬ æ∆≈‰««≥™ æÀ∑Ø¡ˆø° ¥Î«— ¡ˆΩƒ¿Ã∂Ûº≠ ¡¡æ“Ω¿¥œ¥Ÿ. ±Ë¡ˆ«ˆ ±≥ºˆ¥‘ ¡ı∑ ≈‰¿«∂ß ¿œæÓ≥™º≠ πﬂ«•Ω√≈∞¥¬∞‘ æ∆¥œ∞Ì ¡˜¡¢ ø¿º≈º≠ ¿˙»Ò æÍ±‚ µÈæÓ¡÷Ω« ∂ß ∆≤∏±±Ó∫¡ ±‰¿Âµ«¥¬∞Õµµ ¥˙«œ∞Ì ∏∏£¥¬∞≈ ¡˙πÆ«“ ºˆ ¿÷æÓº≠ ¡¡æ“æÓø‰. ¡¡æ“Ω¿¥œ¥Ÿ. ¡ı∑ ≈‰¿«∞° ¿Ã«ÿø° µµøÚ¿Ã µ«æ˙¥Ÿ. æÀ∑π∏£±‚ø°¥Î«ÿ æÀºˆ¿÷æÓº≠ ¡¡æ“Ω¿¥œ¥Ÿ. ¡ı∑ ≈‰¿«. ∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁµÂ∏≥¥œ¥Ÿ. ¥Î∂Ù¿˚¿∏∑Œ ¿˚¥Á. √÷¿Œæ∆ ±≥ºˆ¥‘ ∞≠¿«∑œ¿Ã ≥ π´ ∫∏±‚ æÓ∑∆Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. º“±◊∑Ï≈‰¿«∏¶ ∞≠¿«Ω«ø°º≠ «ÿµµ µ…∞Õ∞∞Ω¿¥œ¥Ÿ. ¡ˆ±›µµ¡¡Ω¿¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫∞° æÁ¿Ã≥ π´∏π¥Ÿ. ∑˘∏∂∆ºΩ∫∫Œ∫–¿Ã ≥ π´ ∏πΩ¿¥œ¥Ÿ. æÁ¿ª ¡∂¿˝«ÿ¡÷º≈º≠ ¿¸¥ﬁ«ÿ¡÷ºÃ∏£∏È «’¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫∞° »ƒπ›ø° ∏Ùæ∆ƒ°¥œ±Ó ø‹øÔ∞‘ ≥ π´ ∏πæ∆ø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿ª ≥ π´ ª°∏Æ«œΩ√¥¬µ• ¡∂±› ø©¿Ø∏¶ ∞°¡ˆ∞Ì ºˆæ˜«ÿ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ §–§– ¿ÃπÃ æ∆¥¬ ≥ªøÎ¿ª ¥ŸΩ√«—π¯ ∞≠¿««ÿ¡÷Ω√¥¬ º”µµ√≥∑≥ ≥ π´ ª°∏Æ ¡¯«‡µ«¥¬∞≈ ∞∞Ω¿¥œ¥Ÿ. ∑˘∏∂∆ºΩ∫≥ª∞˙ ∞≠¿«æÁ¿Ã ∏π¿∫µ• ∫Ò±≥¿˚ µ⁄ø°«ÿº≠ ∞¯∫Œ«œ±‚∞° »˚µÈæ˙Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸ ≥Øø° ¡§∏Æ«“ ºˆ ¿÷¥¬ Ω√∞£¿ª ¡ª ¥ı ¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ. ¡¡¿∫ºˆæ˜ ∞®ªÁµÂ∏≥¥œ¥Ÿ. ∑π∆˜∆Æ µÓ¿« ∆Ú∞°ø‰º“ √ﬂ∞°. √÷¿Œæ∆ ±≥ºˆ¥‘ ∏ª¿Ã ≥ π´ ∫¸∏£º≈ø‰ §–§–. ∏∏£∞⁄¥Ÿ.  ≥ªøÎ¿Ã ∏π¿Ã ∞„ƒ°¥¬µ• ¡§∏Æ«“ ºˆ ¿÷¥¬ ∆ƒ¿œ¿Ã ¿÷æ˙¿∏∏È «’¥œ¥Ÿ. µø¿œ ¡˙»Øø° ¥Î«ÿº≠ ƒ°∑·ø° ¥Î«ÿº≠ ∞∞¿∫ ∞≠¿«∑œ¿∏∑Œ ºˆæ˜ ¡÷ºÃ¿∏∏È ¡¡¿ª∞Õ ∞∞¥Ÿ. ≥—¡∂æ∆ø‰. ∞„ƒ°¥¬ ∫Œ∫–ø° ¿÷æÓº≠ ±≥ºˆ¥‘µÈ¿« º≥∏Ì¿Ã ¿œƒ°«ﬂ¿∏∏È ¥˙ «Ú∞•∏±∞Õ∞∞¥Ÿ. ∆Ø∫∞»˜ æ¯Ω¿¥œ¥Ÿ. Ω√«Ë ¿¸≥Øø°¿÷¥¬ºˆæ˜¿ª ¡ª¥Á∞‹º≠«œ∏È¡¡∞⁄æÓø‰§Ã§Ã. ≥ π´æÁ¿Ã∏πΩ¿¥œ¥Ÿ. æÁ¡ª ¡Ÿø©¡÷ººø‰. √÷¿Œæ∆ ±≥ºˆ¥‘ ¡¶πﬂ ∞≠¿«æÁ¡ª ¡Ÿø©¡÷ºÃ¿∏∏È ¡¡∞⁄Ω¿¥œ¥Ÿ. ¡¡æ“Ω¿¥œ¥Ÿ.æÀ∑π∏£±‚ ¡˙»Øºˆæ˜∞˙ ∑˘∏∂∆ºΩ∫ ¡˙»Øºˆæ˜¿Ã ºØø©¿÷æÓº≠ µŒ ƒ´≈◊∞Ì∏Æ∏¶ ±∏∫–«œ¥¬µ• »˚µÈæ˙Ω¿. ºˆæ˜º”µµ∞° ¥¿∑¡¡≥¿∏∏È ¡¡∞⁄¥Ÿ. ∞¯∫ŒΩ√∞£ ¿Ã ≥À≥À«ﬂ¿∏¡¡∞⁄Ω¿¥œ¥Ÿ. º¯º≠∞° µ⁄¡◊π⁄¡◊¿Ãø°ø‰.∞®ªÁ«’¥œ¥Ÿ. ∞®ªÁ«’¥œ¥Ÿ."

easySenti(doc,positive,negative)
easySenti(doc,positive,negative,t=3) # 3√ ∞˙ ±‡¡§ 
easySenti(doc,positive,negative,sigmoid = TRUE) # Ω√±◊∏¿ÃµÂ, ∞Ê∞Ë∞™ 0.3
easySenti(doc,positive,negative,sigmoid = TRUE, t.s=0.5) # Ω√±◊∏¿ÃµÂ, ∞Ê∞Ë∞™ 0.5
